video2json/app/controllers/task_controller.rb

INSERT INTO `tasks` (`name`, `data`, `status`) VALUES('Created from Rails', NULL, 1)
---
    task = Task.new
    task.name = "Created from Rails"
    task.data = nil
    task.status = true;
    task.save